docs: improve docs formatting
